clc
T = input('Введите температуру в °F: ');
R = input('Введите относительную влажность в %: ');

HI = -42.379 + 2.04901523*T + 10.14333127*R ...
     - 0.22475541*T*R - 6.83783e-3*T^2 ...
     - 5.481717e-2*R^2 + 1.22874e-3*T^2*R ...
     + 8.5282e-4*T*R^2 - 1.99e-6*T^2*R^2;

fprintf('Температура индекса тепла: %d\n', round(HI))

F = 100000;
r = 0.0435;
N = 5:10;

P = F*(r/12) ./ ((1 + r/12).^(12*N) - 1);

disp('   Years    Monthly Payment')
disp([N', P'])

N0 = 1;
k = log(2)/40;
t = 0:120:1440;

N = N0*exp(k*t);

disp('   t (min)    N (bacteria)')
disp([t', N'])

W = 500;
L = 120;
h = 50;
x = 10:20:110;

T = W*L*sqrt(h^2 + x.^2) ./ (h*x);

disp('     x          T')
disp([x', T'])